In [ ]:
Pandas is the most popular python library that is used for data analysis. 
It provides highly optimized performance with back-end source code is purely written in C or Python.
It is an opensource library that allows to you perform data manipulation in Python. 
Pandas library is built on top of Numpy, meaning Pandas needs Numpy to operate. 
Pandas provide an easy way to create, manipulate and wrangle the data. Pandas is also an elegant solution for time series data.



Best way to Install

1. conda install pandas
2. pip install pandas

We can analyze data in pandas with:

1. Series
2. DataFrames

Series:
Series is one dimensional(1-D) array defined in pandas that can be used to store any data type.
  
Data: 
A Scalar value which can be integerValue, string
A Python Dictionary which can be Key, Value pair
A Ndarray
Note: Index by default is from 0, 1, 2, â€¦(n-1) where n is length of data.

In [14]:
########################### Series #########################################

import pandas as pd
 
# a simple list
list = ['g','e','e','k','s','f', 'o','r','g','e','e','k','s']
  
# create series form a list
ser = pd.Series(list)
ser

0     g
1     e
2     e
3     k
4     s
5     f
6     o
7     r
8     g
9     e
10    e
11    k
12    s
dtype: object

In [15]:
#setting the index
ser = pd.Series(list,index=[10,11,12,13,14,15,16,70,80,19,20,21,22])
# accessing a element using index element
print(ser)

10    g
11    e
12    e
13    k
14    s
15    f
16    o
70    r
80    g
19    e
20    e
21    k
22    s
dtype: object

In [31]:
df = pd.read_csv("C:\\Users\\Heenashree_Khandelwa\\PycharmProjects\\Analytics_MovieLens\\MovieLens\\stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82     87.0   845     larry page
1     WMT           4.61    484.0    65           n.a.
2    MSFT             -1     85.0    64     bill gates
3    RIL   not available     50.0  1023  mukesh ambani
4    TATA            5.6     -1.0  n.a.     ratan tata
5    Ford            NaN      NaN   NaN           Ford

In [32]:
df['tickers']

0    GOOGL
1      WMT
2     MSFT
3     RIL
4     TATA
5     Ford
Name: tickers, dtype: object

In [33]:
df['revenue']

0     87.0
1    484.0
2     85.0
3     50.0
4     -1.0
5      NaN
Name: revenue, dtype: float64

In [18]:
#Create dataframe
matrix_data = np.random.randint(1,10,size=20).reshape(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
import pandas as pd
df1 = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
df1

   W  X  Y  Z
A  4  2  3  4
B  4  6  2  2
C  1  5  3  5
D  1  7  1  6
E  2  7  6  6

In [8]:
d={'a':[10,20],'b':[30,40],'c':[50,60]}

In [10]:
df = pd.DataFrame(d)
df

    a   b   c
0  10  30  50
1  20  40  60

In [13]:
#indexing and slicing
#DOT method
#Bracket method
matrix_data = np.random.randint(1,100,100).reshape(25,4)

column_headings = ['W','X','Y','Z']

df = pd.DataFrame(data=matrix_data,columns=column_headings)
df.head(2)

    W   X   Y   Z
0   7  45  99  50
1  71  63  97   6

In [14]:
df['X']

0     45
1     63
2     69
3     69
4     36
5     43
6     66
7     26
8     48
9      6
10    43
11    84
12    74
13    92
14    71
15    24
16     2
17    15
18    21
19    37
20     5
21    90
22    22
23    31
24     3
Name: X, dtype: int32

In [22]:
#Label-based 'loc' method
#Index based 'iloc' method
df1.loc['C']

W    1
X    5
Y    3
Z    5
Name: C, dtype: int32

In [24]:
df1.loc[['B','C']]

   W  X  Y  Z
B  4  6  2  2
C  1  5  3  5

In [25]:
df1.iloc[2]

W    1
X    5
Y    3
Z    5
Name: C, dtype: int32

In [27]:
df1.iloc[[1,3]]

   W  X  Y  Z
B  4  6  2  2
D  1  7  1  6